{
   "class_name":"Sequential",
   "config":{
      "name":"sequential_43",
      "layers":[
         {
            "module":"keras.layers",
            "class_name":"InputLayer",
            "config":{
               "batch_input_shape":[
                  null,
                  4
               ],
               "dtype":"float32",
               "sparse":false,
               "ragged":false,
               "name":"dense_195_input"
            },
            "registered_name":null
         },
         {
            "module":"keras.layers",
            "class_name":"Dense",
            "config":{
               "name":"dense_195",
               "trainable":true,
               "dtype":"float32",
               "batch_input_shape":[
                  null,
                  4
               ],
               "units":64,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "module":"keras.initializers",
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  },
                  "registered_name":null
               },
               "bias_initializer":{
                  "module":"keras.initializers",
                  "class_name":"Zeros",
                  "config":{
                     
                  },
                  "registered_name":null
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "registered_name":null,
            "build_config":{
               "input_shape":[
                  null,
                  4
               ]
            }
         },
         {
            "module":"keras.layers",
            "class_name":"Dropout",
            "config":{
               "name":"dropout_71",
               "trainable":true,
               "dtype":"float32",
               "rate":0.5,
               "noise_shape":null,
               "seed":null
            },
            "registered_name":null,
            "build_config":{
               "input_shape":[
                  null,
                  64
               ]
            }
         },
         {
            "module":"keras.layers",
            "class_name":"Dense",
            "config":{
               "name":"dense_196",
               "trainable":true,
               "dtype":"float32",
               "units":32,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "module":"keras.initializers",
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  },
                  "registered_name":null
               },
               "bias_initializer":{
                  "module":"keras.initializers",
                  "class_name":"Zeros",
                  "config":{
                     
                  },
                  "registered_name":null
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "registered_name":null,
            "build_config":{
               "input_shape":[
                  null,
                  64
               ]
            }
         },
         {
            "module":"keras.layers",
            "class_name":"Dropout",
            "config":{
               "name":"dropout_72",
               "trainable":true,
               "dtype":"float32",
               "rate":0.5,
               "noise_shape":null,
               "seed":null
            },
            "registered_name":null,
            "build_config":{
               "input_shape":[
                  null,
                  32
               ]
            }
         },
         {
            "module":"keras.layers",
            "class_name":"Dense",
            "config":{
               "name":"dense_197",
               "trainable":true,
               "dtype":"float32",
               "units":16,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "module":"keras.initializers",
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  },
                  "registered_name":null
               },
               "bias_initializer":{
                  "module":"keras.initializers",
                  "class_name":"Zeros",
                  "config":{
                     
                  },
                  "registered_name":null
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "registered_name":null,
            "build_config":{
               "input_shape":[
                  null,
                  32
               ]
            }
         },
         {
            "module":"keras.layers",
            "class_name":"Dropout",
            "config":{
               "name":"dropout_73",
               "trainable":true,
               "dtype":"float32",
               "rate":0.5,
               "noise_shape":null,
               "seed":null
            },
            "registered_name":null,
            "build_config":{
               "input_shape":[
                  null,
                  16
               ]
            }
         },
         {
            "module":"keras.layers",
            "class_name":"Dense",
            "config":{
               "name":"dense_198",
               "trainable":true,
               "dtype":"float32",
               "units":3,
               "activation":"softmax",
               "use_bias":true,
               "kernel_initializer":{
                  "module":"keras.initializers",
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  },
                  "registered_name":null
               },
               "bias_initializer":{
                  "module":"keras.initializers",
                  "class_name":"Zeros",
                  "config":{
                     
                  },
                  "registered_name":null
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            },
            "registered_name":null,
            "build_config":{
               "input_shape":[
                  null,
                  16
               ]
            }
         }
      ]
   },
   "keras_version":"2.15.0",
   "backend":"tensorflow"
}